cf_billing/Documents/энргРучноеИзменениеПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргРучноеИзменениеПени</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.энргВзаиморасчетыПоПени</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыИспользованные</xr:Item>
				<xr:Item>AccumulationRegister.энргОплатаПени</xr:Item>
				<xr:Item>AccumulationRegister.энргНачислениеПени</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансыПоступившие</xr:Item>
				<xr:Item>AccumulationRegister.энргАвансы</xr:Item>
				<xr:Item>AccumulationRegister.энргВзаиморасчеты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МКД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСтроения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУчитывать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.энргРегистрацияПросуженнойПени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пени</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодРасчета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПериодНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоСоставнаяУслуга</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРанееНачисленнойПени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоставщикиСоставныхУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧастьСоставнойУслуги</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Плательщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргРучноеИзменениеПени/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

 		
КонецПроцедуры

Процедура ДобавитьКомандуСоздатьНаОсновании(КомандыСоздатьНаОсновании) Экспорт 
	
 
КонецПроцедуры

Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства, Регистры = Неопределено) Экспорт 
	
	ПараметрыЗапроса  			= Новый Структура;
	Схема 						= Неопределено;
	
	ЗаполнитьСхемуЗапроса(Схема, Регистры);
		
	Если ДополнительныеСвойства.Свойство("ТаблицыПодмены") Тогда		
		ВспомогательныеПараметры 	= Новый Структура;
		энргФормированиеТекстовЗапроса.УстановитьПерехватОбращенияКТаблицам(Схема, ДополнительныеСвойства.ТаблицыПодмены, ВспомогательныеПараметры); 
	КонецЕсли;
	
	КлючиТаблицДвижений 			= энргФормированиеТекстовЗапроса.КлючиТаблицДвижений(Схема);
	
	ПараметрыЗапроса 				= Новый Структура;
	ПараметрыЗапроса.Вставить("мДокументы", 					ДокументСсылка);
	//ПараметрыПроведения = ДополнительныеСвойства.ПараметрыПроведения;
	//ПараметрыЗапроса.Вставить("ПериодРегистрации",				ПараметрыПроведения.ПериодРегистрации);
	ПараметрыЗапроса.Вставить("ПустойУникальныйИдентификатор", 	ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор());
		
	ДополнительныеСвойства.Вставить("ТаблицыДвижений", 		энргСхемаЗапросаСервер.ВыполнитьПакет(Схема,ПараметрыЗапроса));
	ДополнительныеСвойства.Вставить("КлючиТаблицДвижений", 	КлючиТаблицДвижений);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РеализацияИнтерефейса_Проведение

Процедура ЗаполнитьСхемуЗапроса(Схема, Регистры)
	ДобавитьТекстЗапросаНачислениеПени(Схема, Регистры);
	ДобавитьТекстЗапросаВзаиморасчетыПоПени(Схема, Регистры);// Перенести в восстановление последовательности!!!
	ДобавитьТекстЗапросаВзаиморасчеты(Схема, Регистры);
КонецПроцедуры

Процедура ДобавитьТекстЗапросаНачислениеПени(Схема, Регистры)
	
	ИмяРегистра = "энргНачислениеПени";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргРучноеИзменениеПени.Дата КАК Период,
	|	энргРучноеИзменениеПени.Организация КАК Организация,
	|	энргРучноеИзменениеПени.Район КАК Район,
	|	энргРучноеИзменениеПени.Абонент КАК Абонент,
	|	энргРучноеИзменениеПениПени.Услуга КАК Услуга,
	|	энргРучноеИзменениеПениПени.Поставщик КАК Поставщик,
	|	энргРучноеИзменениеПени.ПериодНачисления КАК ПериодРасчета,
	|	энргРучноеИзменениеПениПени.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(энргРучноеИзменениеПениПени.Сумма) КАК Сумма,
	|	энргРучноеИзменениеПени.МКД КАК МКД
	|ИЗ
	|	Документ.энргРучноеИзменениеПени КАК энргРучноеИзменениеПени
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРучноеИзменениеПени.Пени КАК энргРучноеИзменениеПениПени
	|		ПО энргРучноеИзменениеПени.Ссылка = энргРучноеИзменениеПениПени.Ссылка
	|			И (энргРучноеИзменениеПениПени.Ссылка В (&мДокументы))
	|
	|СГРУППИРОВАТЬ ПО
	|	энргРучноеИзменениеПени.Дата,
	|	энргРучноеИзменениеПени.Организация,
	|	энргРучноеИзменениеПени.Район,
	|	энргРучноеИзменениеПени.Абонент,
	|	энргРучноеИзменениеПениПени.Услуга,
	|	энргРучноеИзменениеПениПени.Поставщик,
	|	энргРучноеИзменениеПени.ПериодНачисления,
	|	энргРучноеИзменениеПениПени.ПериодНачисления,
	|	энргРучноеИзменениеПени.МКД";
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВзаиморасчетыПоПени(Схема, Регистры)
	// Удалить метод. Исправить ручной перерасчет пени
	ИмяРегистра = "энргВзаиморасчетыПоПени";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргРучноеИзменениеПени.Дата КАК Период,
	|	энргРучноеИзменениеПени.Организация КАК Организация,
	|	энргРучноеИзменениеПени.Район КАК Район,
	|	энргРучноеИзменениеПени.МКД КАК МКД,
	|	энргРучноеИзменениеПени.Абонент КАК Абонент,
	|	энргРучноеИзменениеПениПени.Услуга КАК Услуга,
	|	энргРучноеИзменениеПениПени.Поставщик КАК Поставщик,
	|	энргРучноеИзменениеПениПени.ПериодНачисления КАК ПериодНачисления,
	|	энргРучноеИзменениеПениПени.ПериодРасчета КАК ПериодРасчета,
	|	СУММА(энргРучноеИзменениеПениПени.Сумма) КАК Сумма
	|ИЗ
	|	Документ.энргРучноеИзменениеПени КАК энргРучноеИзменениеПени
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРучноеИзменениеПени.Пени КАК энргРучноеИзменениеПениПени
	|		ПО энргРучноеИзменениеПени.Ссылка = энргРучноеИзменениеПениПени.Ссылка
	|			И (энргРучноеИзменениеПениПени.Ссылка В (&мДокументы))
	|
	|СГРУППИРОВАТЬ ПО
	|	энргРучноеИзменениеПени.Дата,
	|	энргРучноеИзменениеПени.Организация,
	|	энргРучноеИзменениеПени.Район,
	|	энргРучноеИзменениеПени.Абонент,
	|	энргРучноеИзменениеПениПени.Услуга,
	|	энргРучноеИзменениеПениПени.Поставщик,
	|	энргРучноеИзменениеПениПени.ПериодНачисления,
	|	энргРучноеИзменениеПени.МКД,
	|	энргРучноеИзменениеПениПени.ПериодРасчета";
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

Процедура ДобавитьТекстЗапросаВзаиморасчеты(Схема, Регистры)
	// Удалить метод. Исправить ручной перерасчет пени
	ИмяРегистра = "энргВзаиморасчеты";
	
	Если НЕ энргПроведениеСервер.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;
	
	Если Схема = Неопределено Тогда
		Схема 	= новый СхемаЗапроса;
		Пакет 	= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 	= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса"));
	КонецЕсли;
	
	Текст  	= 
	"ВЫБРАТЬ
	|	энргРучноеИзменениеПени.Дата КАК Период,
	|	энргРучноеИзменениеПени.Организация КАК Организация,
	|	энргРучноеИзменениеПени.Район КАК Район,
	|	энргРучноеИзменениеПени.МКД КАК МКД,
	|	энргРучноеИзменениеПени.Абонент КАК Абонент,
	|	энргРучноеИзменениеПени.ПериодНачисления КАК ПериодНачисления,
	|	СУММА(энргРучноеИзменениеПениПени.Сумма) КАК Сумма
	|ИЗ
	|	Документ.энргРучноеИзменениеПени КАК энргРучноеИзменениеПени
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргРучноеИзменениеПени.Пени КАК энргРучноеИзменениеПениПени
	|		ПО энргРучноеИзменениеПени.Ссылка = энргРучноеИзменениеПениПени.Ссылка
	|			И (энргРучноеИзменениеПениПени.Ссылка В (&мДокументы))
	|
	|СГРУППИРОВАТЬ ПО
	|	энргРучноеИзменениеПени.Дата,
	|	энргРучноеИзменениеПени.Организация,
	|	энргРучноеИзменениеПени.Район,
	|	энргРучноеИзменениеПени.Абонент,
	|	энргРучноеИзменениеПени.МКД,
	|	энргРучноеИзменениеПени.ПериодНачисления";
			
	Пакет.УстановитьТекстЗапроса(Текст);
	Пакет.ТаблицаДляПомещения = "Набор" + ИмяРегистра;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
